#### Terraform Plan 📖`success`
<details><summary>Show Plan</summary>

```terraform
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cedi/k8s-cedi-dev/runs/run-GcxiQhrCsbtDGmmn

Waiting for the plan to start...

Terraform v1.2.3
on linux_amd64
Initializing plugins and modules...

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # cloudflare_record.dns_api_v4 will be created
  + resource "cloudflare_record" "dns_api_v4" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "69e6bcd8df08222aae8f102910c5df9d"
    }

  # cloudflare_record.dns_api_v6 will be created
  + resource "cloudflare_record" "dns_api_v6" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "69e6bcd8df08222aae8f102910c5df9d"
    }

  # cloudflare_record.dns_v4_api1 will be created
  + resource "cloudflare_record" "dns_v4_api1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api1"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "69e6bcd8df08222aae8f102910c5df9d"
    }

  # cloudflare_record.dns_v4_api2 will be created
  + resource "cloudflare_record" "dns_v4_api2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api2"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "69e6bcd8df08222aae8f102910c5df9d"
    }

  # cloudflare_record.dns_v4_api3 will be created
  + resource "cloudflare_record" "dns_v4_api3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api3"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "A"
      + value           = (known after apply)
      + zone_id         = "69e6bcd8df08222aae8f102910c5df9d"
    }

  # cloudflare_record.dns_v6_api1 will be created
  + resource "cloudflare_record" "dns_v6_api1" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api1"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "69e6bcd8df08222aae8f102910c5df9d"
    }

  # cloudflare_record.dns_v6_api2 will be created
  + resource "cloudflare_record" "dns_v6_api2" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api2"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "69e6bcd8df08222aae8f102910c5df9d"
    }

  # cloudflare_record.dns_v6_api3 will be created
  + resource "cloudflare_record" "dns_v6_api3" {
      + allow_overwrite = false
      + created_on      = (known after apply)
      + hostname        = (known after apply)
      + id              = (known after apply)
      + metadata        = (known after apply)
      + modified_on     = (known after apply)
      + name            = "api3"
      + proxiable       = (known after apply)
      + proxied         = false
      + ttl             = 1
      + type            = "AAAA"
      + value           = (known after apply)
      + zone_id         = "69e6bcd8df08222aae8f102910c5df9d"
    }

  # hcloud_firewall.api-fw will be created
  + resource "hcloud_firewall" "api-fw" {
      + id     = (known after apply)
      + labels = {
          + "cluster" = "cedi-dev"
          + "role"    = "api"
        }
      + name   = "cedi-dev-fw"

      + apply_to {
          + label_selector = "cluster=av0"
          + server         = (known after apply)
        }

      + rule {
          + description     = "allow ICMP"
          + destination_ips = []
          + direction       = "in"
          + protocol        = "icmp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "allow NodePorts from any"
          + destination_ips = []
          + direction       = "in"
          + port            = "30000-32767"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "allow SSH from any"
          + destination_ips = []
          + direction       = "in"
          + port            = "22"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
      + rule {
          + description     = "allow all TCP inside cluster"
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "tcp"
          + source_ips      = [
              + "192.168.0.0/16",
            ]
        }
      + rule {
          + description     = "allow all UDP inside cluster"
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "udp"
          + source_ips      = [
              + "192.168.0.0/16",
            ]
        }
      + rule {
          + description     = "allow hetzner api and metadata servers tcp"
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "tcp"
          + source_ips      = [
              + "169.254.169.254/32",
              + "213.239.246.1/32",
            ]
        }
      + rule {
          + description     = "allow hetzner api and metadata servers udp"
          + destination_ips = []
          + direction       = "in"
          + port            = "any"
          + protocol        = "udp"
          + source_ips      = [
              + "169.254.169.254/32",
              + "213.239.246.1/32",
            ]
        }
      + rule {
          + description     = "allow kubectl from any"
          + destination_ips = []
          + direction       = "in"
          + port            = "6443"
          + protocol        = "tcp"
          + source_ips      = [
              + "0.0.0.0/0",
              + "::/0",
            ]
        }
    }

  # hcloud_load_balancer.load_balancer will be created
  + resource "hcloud_load_balancer" "load_balancer" {
      + delete_protection  = false
      + id                 = (known after apply)
      + ipv4               = (known after apply)
      + ipv6               = (known after apply)
      + labels             = {
          + "cluster" = "cedi-dev"
          + "role"    = "lb"
        }
      + load_balancer_type = "lb11"
      + location           = "nbg1"
      + name               = "cedi-dev-api-lb"
      + network_id         = (known after apply)
      + network_ip         = (known after apply)
      + network_zone       = (known after apply)

      + algorithm {
          + type = (known after apply)
        }

      + target {
          + server_id      = (known after apply)
          + type           = (known after apply)
          + use_private_ip = (known after apply)
        }
    }

  # hcloud_load_balancer_network.load_balancer will be created
  + resource "hcloud_load_balancer_network" "load_balancer" {
      + enable_public_interface = true
      + id                      = (known after apply)
      + ip                      = (known after apply)
      + load_balancer_id        = (known after apply)
      + subnet_id               = (known after apply)
    }

  # hcloud_load_balancer_service.api_service will be created
  + resource "hcloud_load_balancer_service" "api_service" {
      + destination_port = 6443
      + id               = (known after apply)
      + listen_port      = 6443
      + load_balancer_id = (known after apply)
      + protocol         = "tcp"
      + proxyprotocol    = (known after apply)

      + health_check {
          + interval = (known after apply)
          + port     = (known after apply)
          + protocol = (known after apply)
          + retries  = (known after apply)
          + timeout  = (known after apply)

          + http {
              + domain       = (known after apply)
              + path         = (known after apply)
              + response     = (known after apply)
              + status_codes = (known after apply)
              + tls          = (known after apply)
            }
        }

      + http {
          + certificates    = (known after apply)
          + cookie_lifetime = (known after apply)
          + cookie_name     = (known after apply)
          + redirect_http   = (known after apply)
          + sticky_sessions = (known after apply)
        }
    }

  # hcloud_load_balancer_target.lb_target_cp1 will be created
  + resource "hcloud_load_balancer_target" "lb_target_cp1" {
      + id               = (known after apply)
      + load_balancer_id = (known after apply)
      + server_id        = (known after apply)
      + type             = "server"
      + use_private_ip   = true
    }

  # hcloud_load_balancer_target.lb_target_cp2 will be created
  + resource "hcloud_load_balancer_target" "lb_target_cp2" {
      + id               = (known after apply)
      + load_balancer_id = (known after apply)
      + server_id        = (known after apply)
      + type             = "server"
      + use_private_ip   = true
    }

  # hcloud_load_balancer_target.lb_target_cp3 will be created
  + resource "hcloud_load_balancer_target" "lb_target_cp3" {
      + id               = (known after apply)
      + load_balancer_id = (known after apply)
      + server_id        = (known after apply)
      + type             = "server"
      + use_private_ip   = true
    }

  # hcloud_network.net will be created
  + resource "hcloud_network" "net" {
      + delete_protection = false
      + id                = (known after apply)
      + ip_range          = "192.168.0.0/16"
      + name              = "cedi-dev"
    }

  # hcloud_network_subnet.kubeone will be created
  + resource "hcloud_network_subnet" "kubeone" {
      + gateway      = (known after apply)
      + id           = (known after apply)
      + ip_range     = "192.168.0.0/16"
      + network_id   = (known after apply)
      + network_zone = "eu-central"
      + type         = "server"
    }

  # hcloud_placement_group.control_plane_placement will be created
  + resource "hcloud_placement_group" "control_plane_placement" {
      + id      = (known after apply)
      + labels  = {
          + "cluster" = "cedi-dev"
          + "role"    = "api"
        }
      + name    = "api placement"
      + servers = (known after apply)
      + type    = "spread"
    }

  # hcloud_rdns.rdns_api1 will be created
  + resource "hcloud_rdns" "rdns_api1" {
      + dns_ptr    = "api1.cedi.dev"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + server_id  = (known after apply)
    }

  # hcloud_rdns.rdns_api2 will be created
  + resource "hcloud_rdns" "rdns_api2" {
      + dns_ptr    = "api2.cedi.dev"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + server_id  = (known after apply)
    }

  # hcloud_rdns.rdns_api3 will be created
  + resource "hcloud_rdns" "rdns_api3" {
      + dns_ptr    = "api3.cedi.dev"
      + id         = (known after apply)
      + ip_address = (known after apply)
      + server_id  = (known after apply)
    }

  # hcloud_server.control_plane1 will be created
  + resource "hcloud_server" "control_plane1" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster" = "cedi-dev"
          + "role"    = "api"
        }
      + location                   = "nbg1"
      + name                       = "api1.cedi.dev"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "cedi@ivy",
          + "cedi@mae",
          + "ghaction",
        ]
      + status                     = (known after apply)
    }

  # hcloud_server.control_plane2 will be created
  + resource "hcloud_server" "control_plane2" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster" = "cedi-dev"
          + "role"    = "api"
        }
      + location                   = "nbg1"
      + name                       = "api2.cedi.dev"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "cedi@ivy",
          + "cedi@mae",
          + "ghaction",
        ]
      + status                     = (known after apply)
    }

  # hcloud_server.control_plane3 will be created
  + resource "hcloud_server" "control_plane3" {
      + allow_deprecated_images    = false
      + backup_window              = (known after apply)
      + backups                    = false
      + datacenter                 = (known after apply)
      + delete_protection          = false
      + firewall_ids               = (known after apply)
      + id                         = (known after apply)
      + ignore_remote_firewall_ids = false
      + image                      = "ubuntu-20.04"
      + ipv4_address               = (known after apply)
      + ipv6_address               = (known after apply)
      + ipv6_network               = (known after apply)
      + keep_disk                  = false
      + labels                     = {
          + "cluster" = "cedi-dev"
          + "role"    = "api"
        }
      + location                   = "nbg1"
      + name                       = "api3.cedi.dev"
      + placement_group_id         = (known after apply)
      + rebuild_protection         = false
      + server_type                = "cx21"
      + ssh_keys                   = [
          + "cedi@ivy",
          + "cedi@mae",
          + "ghaction",
        ]
      + status                     = (known after apply)
    }

  # hcloud_server_network.control_plane1 will be created
  + resource "hcloud_server_network" "control_plane1" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + server_id   = (known after apply)
      + subnet_id   = (known after apply)
    }

  # hcloud_server_network.control_plane2 will be created
  + resource "hcloud_server_network" "control_plane2" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + server_id   = (known after apply)
      + subnet_id   = (known after apply)
    }

  # hcloud_server_network.control_plane3 will be created
  + resource "hcloud_server_network" "control_plane3" {
      + id          = (known after apply)
      + ip          = (known after apply)
      + mac_address = (known after apply)
      + server_id   = (known after apply)
      + subnet_id   = (known after apply)
    }

  # hcloud_ssh_key.cedi_devpi will be created
  + resource "hcloud_ssh_key" "cedi_devpi" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "cedi@devpi"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIFd4lpqMI7I9fPboMNhGzVrel0cir3D7bHLHADqE1Kmf"
    }

  # hcloud_ssh_key.cedi_ivy will be created
  + resource "hcloud_ssh_key" "cedi_ivy" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "cedi@ivy"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKKQwlVWSGICyOiVryEdEp8bR+ltCxSeikxPTRRgSssL"
    }

  # hcloud_ssh_key.cedi_mae will be created
  + resource "hcloud_ssh_key" "cedi_mae" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "cedi@mae"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIOO9DMiwRjCCWvMA9TKYxRApgQx3g+owxkq9jy1YyjGN cedi@mae"
    }

  # hcloud_ssh_key.ghaction will be created
  + resource "hcloud_ssh_key" "ghaction" {
      + fingerprint = (known after apply)
      + id          = (known after apply)
      + name        = "ghaction"
      + public_key  = "ssh-ed25519 AAAAC3NzaC1lZDI1NTE5AAAAIKoYpUOVAPNNLTi2sq8pouG2QTrdOccPBKYbPXfdByMz"
    }

Plan: 31 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + control_plane_info = {
      + image    = "ubuntu-20.04"
      + location = "nbg1"
    }
  + kubeone_api        = {
      + apiserver_alternative_names = []
      + endpoint                    = "api.cedi.dev"
    }
  + kubeone_hosts      = {
      + control_plane = {
          + cloud_provider       = "hetzner"
          + cluster_name         = "cedi-dev"
          + network_id           = (known after apply)
          + private_address      = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + public_address       = [
              + (known after apply),
              + (known after apply),
              + (known after apply),
            ]
          + ssh_agent_socket     = ""
          + ssh_port             = 22
          + ssh_private_key_file = "/home/runner/.ssh/id_ed25519"
          + ssh_user             = "root"
        }
    }
```

</details>

__Author:__ @renovate[bot],
__Action:__ `pull_request`